; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph0 - mode
	image2 - mode
	image4 - mode
	infrared1 - mode
	image3 - mode
	Star0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation22 - direction
	Star24 - direction
	Star26 - direction
	GroundStation35 - direction
	Star36 - direction
	Star37 - direction
	GroundStation41 - direction
	Star45 - direction
	Star48 - direction
	GroundStation31 - direction
	Star42 - direction
	GroundStation19 - direction
	GroundStation25 - direction
	Star15 - direction
	GroundStation10 - direction
	Star12 - direction
	GroundStation28 - direction
	GroundStation32 - direction
	GroundStation34 - direction
	Star7 - direction
	Star14 - direction
	Star13 - direction
	Star43 - direction
	Star17 - direction
	GroundStation16 - direction
	GroundStation38 - direction
	GroundStation2 - direction
	GroundStation27 - direction
	GroundStation9 - direction
	Star8 - direction
	GroundStation39 - direction
	GroundStation49 - direction
	Star40 - direction
	Star47 - direction
	GroundStation21 - direction
	Star46 - direction
	Star44 - direction
	GroundStation20 - direction
	Star29 - direction
	GroundStation23 - direction
	Star18 - direction
	GroundStation33 - direction
	GroundStation1 - direction
	GroundStation11 - direction
	Star5 - direction
	Star30 - direction
	Star6 - direction
	Star50 - direction
	Star51 - direction
	Star52 - direction
	Phenomenon53 - direction
	Star54 - direction
	Phenomenon55 - direction
	Planet56 - direction
	Planet57 - direction
	Star58 - direction
	Planet59 - direction
	Star60 - direction
	Planet61 - direction
	Phenomenon62 - direction
	Phenomenon63 - direction
	Star64 - direction
	Phenomenon65 - direction
	Phenomenon66 - direction
	Star67 - direction
	Star68 - direction
	Planet69 - direction
	Phenomenon70 - direction
	Phenomenon71 - direction
	Star72 - direction
	Star73 - direction
	Star74 - direction
	Star75 - direction
	Planet76 - direction
	Planet77 - direction
	Planet78 - direction
	Star79 - direction
	Star80 - direction
	Phenomenon81 - direction
	Planet82 - direction
	Planet83 - direction
	Star84 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image2)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation31)
	(calibration_target instrument0 Star30)
	(calibration_target instrument0 Star18)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image4)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation25)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 Star29)
	(calibration_target instrument1 GroundStation27)
	(calibration_target instrument1 Star42)
	(calibration_target instrument1 Star43)
	(calibration_target instrument1 GroundStation11)
	(supports instrument2 image3)
	(supports instrument2 spectrograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation38)
	(calibration_target instrument2 Star15)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 Star46)
	(calibration_target instrument2 GroundStation39)
	(calibration_target instrument2 GroundStation25)
	(calibration_target instrument2 GroundStation19)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star44)
	(supports instrument3 image3)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation34)
	(calibration_target instrument3 Star30)
	(calibration_target instrument3 GroundStation32)
	(calibration_target instrument3 GroundStation49)
	(calibration_target instrument3 GroundStation28)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation41)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(supports instrument4 image4)
	(calibration_target instrument4 GroundStation27)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation38)
	(calibration_target instrument4 Star18)
	(calibration_target instrument4 GroundStation16)
	(calibration_target instrument4 Star17)
	(calibration_target instrument4 GroundStation33)
	(calibration_target instrument4 Star43)
	(calibration_target instrument4 GroundStation49)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet78)
	(supports instrument5 image3)
	(supports instrument5 image2)
	(calibration_target instrument5 Star44)
	(calibration_target instrument5 Star46)
	(calibration_target instrument5 GroundStation21)
	(calibration_target instrument5 Star47)
	(calibration_target instrument5 Star40)
	(calibration_target instrument5 GroundStation49)
	(calibration_target instrument5 GroundStation39)
	(calibration_target instrument5 Star29)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation9)
	(supports instrument6 image4)
	(supports instrument6 image3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star30)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation33)
	(calibration_target instrument6 Star18)
	(calibration_target instrument6 GroundStation23)
	(calibration_target instrument6 Star29)
	(calibration_target instrument6 GroundStation20)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon65)
)
(:goal (and
	(pointing satellite0 GroundStation41)
	(pointing satellite3 Star50)
	(have_image Star50 infrared1)
	(have_image Star51 image2)
	(have_image Star52 infrared1)
	(have_image Phenomenon53 image3)
	(have_image Star54 infrared1)
	(have_image Phenomenon55 spectrograph0)
	(have_image Planet56 image4)
	(have_image Planet57 spectrograph0)
	(have_image Star58 image4)
	(have_image Planet59 image4)
	(have_image Star60 infrared1)
	(have_image Planet61 image3)
	(have_image Phenomenon62 image2)
	(have_image Phenomenon63 image3)
	(have_image Star64 infrared1)
	(have_image Phenomenon65 image4)
	(have_image Phenomenon66 spectrograph0)
	(have_image Star67 image2)
	(have_image Star68 infrared1)
	(have_image Planet69 spectrograph0)
	(have_image Phenomenon70 image4)
	(have_image Phenomenon71 image4)
	(have_image Star72 image3)
	(have_image Star73 spectrograph0)
	(have_image Star74 spectrograph0)
	(have_image Star75 infrared1)
	(have_image Planet76 spectrograph0)
	(have_image Planet77 image4)
	(have_image Planet78 spectrograph0)
	(have_image Star79 image4)
	(have_image Star80 image4)
	(have_image Phenomenon81 image3)
	(have_image Planet82 infrared1)
	(have_image Planet83 image3)
	(have_image Star84 infrared1)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 37
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 37
3. (turn_to satellite0 groundstation41 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation41)
   goals met: 1 of 37
4. (turn_to satellite3 star43 planet78)
   deleted: (pointing satellite3 planet78)
   added: (pointing satellite3 star43)
   goals met: 1 of 37
5. (calibrate satellite3 instrument4 star43)
   added: (calibrated instrument4)
   goals met: 1 of 37
6. (turn_to satellite3 phenomenon55 star43)
   deleted: (pointing satellite3 star43)
   added: (pointing satellite3 phenomenon55)
   goals met: 1 of 37
7. (take_image satellite3 phenomenon55 instrument4 spectrograph0)
   added: (have_image phenomenon55 spectrograph0)
   goals met: 2 of 37
8. (turn_to satellite3 phenomenon65 phenomenon55)
   deleted: (pointing satellite3 phenomenon55)
   added: (pointing satellite3 phenomenon65)
   goals met: 2 of 37
9. (take_image satellite3 phenomenon65 instrument4 image4)
   added: (have_image phenomenon65 image4)
   goals met: 3 of 37
10. (turn_to satellite3 phenomenon66 phenomenon65)
   deleted: (pointing satellite3 phenomenon65)
   added: (pointing satellite3 phenomenon66)
   goals met: 3 of 37
11. (take_image satellite3 phenomenon66 instrument4 spectrograph0)
   added: (have_image phenomenon66 spectrograph0)
   goals met: 4 of 37
12. (turn_to satellite3 phenomenon70 phenomenon66)
   deleted: (pointing satellite3 phenomenon66)
   added: (pointing satellite3 phenomenon70)
   goals met: 4 of 37
13. (take_image satellite3 phenomenon70 instrument4 image4)
   added: (have_image phenomenon70 image4)
   goals met: 5 of 37
14. (turn_to satellite3 phenomenon71 phenomenon70)
   deleted: (pointing satellite3 phenomenon70)
   added: (pointing satellite3 phenomenon71)
   goals met: 5 of 37
15. (take_image satellite3 phenomenon71 instrument4 image4)
   added: (have_image phenomenon71 image4)
   goals met: 6 of 37
16. (turn_to satellite3 planet56 phenomenon71)
   deleted: (pointing satellite3 phenomenon71)
   added: (pointing satellite3 planet56)
   goals met: 6 of 37
17. (take_image satellite3 planet56 instrument4 image4)
   added: (have_image planet56 image4)
   goals met: 7 of 37
18. (turn_to satellite3 planet57 planet56)
   deleted: (pointing satellite3 planet56)
   added: (pointing satellite3 planet57)
   goals met: 7 of 37
19. (take_image satellite3 planet57 instrument4 spectrograph0)
   added: (have_image planet57 spectrograph0)
   goals met: 8 of 37
20. (turn_to satellite3 planet59 planet57)
   deleted: (pointing satellite3 planet57)
   added: (pointing satellite3 planet59)
   goals met: 8 of 37
21. (take_image satellite3 planet59 instrument4 image4)
   added: (have_image planet59 image4)
   goals met: 9 of 37
22. (turn_to satellite3 planet69 planet59)
   deleted: (pointing satellite3 planet59)
   added: (pointing satellite3 planet69)
   goals met: 9 of 37
23. (take_image satellite3 planet69 instrument4 spectrograph0)
   added: (have_image planet69 spectrograph0)
   goals met: 10 of 37
24. (turn_to satellite3 planet76 planet69)
   deleted: (pointing satellite3 planet69)
   added: (pointing satellite3 planet76)
   goals met: 10 of 37
25. (take_image satellite3 planet76 instrument4 spectrograph0)
   added: (have_image planet76 spectrograph0)
   goals met: 11 of 37
26. (turn_to satellite3 planet77 planet76)
   deleted: (pointing satellite3 planet76)
   added: (pointing satellite3 planet77)
   goals met: 11 of 37
27. (take_image satellite3 planet77 instrument4 image4)
   added: (have_image planet77 image4)
   goals met: 12 of 37
28. (turn_to satellite3 planet78 planet77)
   deleted: (pointing satellite3 planet77)
   added: (pointing satellite3 planet78)
   goals met: 12 of 37
29. (take_image satellite3 planet78 instrument4 spectrograph0)
   added: (have_image planet78 spectrograph0)
   goals met: 13 of 37
30. (turn_to satellite3 planet82 planet78)
   deleted: (pointing satellite3 planet78)
   added: (pointing satellite3 planet82)
   goals met: 13 of 37
31. (take_image satellite3 planet82 instrument4 infrared1)
   added: (have_image planet82 infrared1)
   goals met: 14 of 37
32. (turn_to satellite3 star50 planet82)
   deleted: (pointing satellite3 planet82)
   added: (pointing satellite3 star50)
   goals met: 15 of 37
33. (take_image satellite3 star50 instrument4 infrared1)
   added: (have_image star50 infrared1)
   goals met: 16 of 37
34. (turn_to satellite3 star52 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star52)
   goals met: 15 of 37
35. (take_image satellite3 star52 instrument4 infrared1)
   added: (have_image star52 infrared1)
   goals met: 16 of 37
36. (turn_to satellite3 star50 star52)
   deleted: (pointing satellite3 star52)
   added: (pointing satellite3 star50)
   goals met: 17 of 37
37. (turn_to satellite3 star54 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star54)
   goals met: 16 of 37
38. (take_image satellite3 star54 instrument4 infrared1)
   added: (have_image star54 infrared1)
   goals met: 17 of 37
39. (turn_to satellite3 star50 star54)
   deleted: (pointing satellite3 star54)
   added: (pointing satellite3 star50)
   goals met: 18 of 37
40. (turn_to satellite3 star58 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star58)
   goals met: 17 of 37
41. (take_image satellite3 star58 instrument4 image4)
   added: (have_image star58 image4)
   goals met: 18 of 37
42. (turn_to satellite3 star50 star58)
   deleted: (pointing satellite3 star58)
   added: (pointing satellite3 star50)
   goals met: 19 of 37
43. (turn_to satellite3 star60 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star60)
   goals met: 18 of 37
44. (take_image satellite3 star60 instrument4 infrared1)
   added: (have_image star60 infrared1)
   goals met: 19 of 37
45. (turn_to satellite3 star50 star60)
   deleted: (pointing satellite3 star60)
   added: (pointing satellite3 star50)
   goals met: 20 of 37
46. (turn_to satellite3 star64 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star64)
   goals met: 19 of 37
47. (take_image satellite3 star64 instrument4 infrared1)
   added: (have_image star64 infrared1)
   goals met: 20 of 37
48. (turn_to satellite3 star50 star64)
   deleted: (pointing satellite3 star64)
   added: (pointing satellite3 star50)
   goals met: 21 of 37
49. (turn_to satellite3 star68 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star68)
   goals met: 20 of 37
50. (take_image satellite3 star68 instrument4 infrared1)
   added: (have_image star68 infrared1)
   goals met: 21 of 37
51. (turn_to satellite3 star50 star68)
   deleted: (pointing satellite3 star68)
   added: (pointing satellite3 star50)
   goals met: 22 of 37
52. (turn_to satellite3 star73 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star73)
   goals met: 21 of 37
53. (take_image satellite3 star73 instrument4 spectrograph0)
   added: (have_image star73 spectrograph0)
   goals met: 22 of 37
54. (turn_to satellite3 star50 star73)
   deleted: (pointing satellite3 star73)
   added: (pointing satellite3 star50)
   goals met: 23 of 37
55. (turn_to satellite3 star74 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star74)
   goals met: 22 of 37
56. (take_image satellite3 star74 instrument4 spectrograph0)
   added: (have_image star74 spectrograph0)
   goals met: 23 of 37
57. (turn_to satellite3 star50 star74)
   deleted: (pointing satellite3 star74)
   added: (pointing satellite3 star50)
   goals met: 24 of 37
58. (turn_to satellite3 star75 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star75)
   goals met: 23 of 37
59. (take_image satellite3 star75 instrument4 infrared1)
   added: (have_image star75 infrared1)
   goals met: 24 of 37
60. (turn_to satellite3 star50 star75)
   deleted: (pointing satellite3 star75)
   added: (pointing satellite3 star50)
   goals met: 25 of 37
61. (turn_to satellite3 star79 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star79)
   goals met: 24 of 37
62. (take_image satellite3 star79 instrument4 image4)
   added: (have_image star79 image4)
   goals met: 25 of 37
63. (turn_to satellite3 star50 star79)
   deleted: (pointing satellite3 star79)
   added: (pointing satellite3 star50)
   goals met: 26 of 37
64. (turn_to satellite3 star80 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star80)
   goals met: 25 of 37
65. (take_image satellite3 star80 instrument4 image4)
   added: (have_image star80 image4)
   goals met: 26 of 37
66. (turn_to satellite3 star50 star80)
   deleted: (pointing satellite3 star80)
   added: (pointing satellite3 star50)
   goals met: 27 of 37
67. (turn_to satellite3 star84 star50)
   deleted: (pointing satellite3 star50)
   added: (pointing satellite3 star84)
   goals met: 26 of 37
68. (take_image satellite3 star84 instrument4 infrared1)
   added: (have_image star84 infrared1)
   goals met: 27 of 37
69. (turn_to satellite3 star50 star84)
   deleted: (pointing satellite3 star84)
   added: (pointing satellite3 star50)
   goals met: 28 of 37
70. (turn_to satellite0 star30 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 star30)
   goals met: 27 of 37
71. (calibrate satellite0 instrument0 star30)
   added: (calibrated instrument0)
   goals met: 27 of 37
72. (turn_to satellite0 groundstation41 star30)
   deleted: (pointing satellite0 star30)
   added: (pointing satellite0 groundstation41)
   goals met: 28 of 37
73. (turn_to satellite0 phenomenon53 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 phenomenon53)
   goals met: 27 of 37
74. (take_image satellite0 phenomenon53 instrument0 image3)
   added: (have_image phenomenon53 image3)
   goals met: 28 of 37
75. (turn_to satellite0 groundstation41 phenomenon53)
   deleted: (pointing satellite0 phenomenon53)
   added: (pointing satellite0 groundstation41)
   goals met: 29 of 37
76. (turn_to satellite0 phenomenon62 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 phenomenon62)
   goals met: 28 of 37
77. (take_image satellite0 phenomenon62 instrument0 image2)
   added: (have_image phenomenon62 image2)
   goals met: 29 of 37
78. (turn_to satellite0 groundstation41 phenomenon62)
   deleted: (pointing satellite0 phenomenon62)
   added: (pointing satellite0 groundstation41)
   goals met: 30 of 37
79. (turn_to satellite0 phenomenon63 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 phenomenon63)
   goals met: 29 of 37
80. (take_image satellite0 phenomenon63 instrument0 image3)
   added: (have_image phenomenon63 image3)
   goals met: 30 of 37
81. (turn_to satellite0 groundstation41 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 groundstation41)
   goals met: 31 of 37
82. (turn_to satellite0 phenomenon81 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 phenomenon81)
   goals met: 30 of 37
83. (take_image satellite0 phenomenon81 instrument0 image3)
   added: (have_image phenomenon81 image3)
   goals met: 31 of 37
84. (turn_to satellite0 groundstation41 phenomenon81)
   deleted: (pointing satellite0 phenomenon81)
   added: (pointing satellite0 groundstation41)
   goals met: 32 of 37
85. (turn_to satellite0 planet61 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 planet61)
   goals met: 31 of 37
86. (take_image satellite0 planet61 instrument0 image3)
   added: (have_image planet61 image3)
   goals met: 32 of 37
87. (turn_to satellite0 groundstation41 planet61)
   deleted: (pointing satellite0 planet61)
   added: (pointing satellite0 groundstation41)
   goals met: 33 of 37
88. (turn_to satellite0 planet83 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 planet83)
   goals met: 32 of 37
89. (take_image satellite0 planet83 instrument0 image3)
   added: (have_image planet83 image3)
   goals met: 33 of 37
90. (turn_to satellite0 groundstation41 planet83)
   deleted: (pointing satellite0 planet83)
   added: (pointing satellite0 groundstation41)
   goals met: 34 of 37
91. (turn_to satellite0 star51 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 star51)
   goals met: 33 of 37
92. (take_image satellite0 star51 instrument0 image2)
   added: (have_image star51 image2)
   goals met: 34 of 37
93. (turn_to satellite0 groundstation41 star51)
   deleted: (pointing satellite0 star51)
   added: (pointing satellite0 groundstation41)
   goals met: 35 of 37
94. (turn_to satellite0 star67 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 star67)
   goals met: 34 of 37
95. (take_image satellite0 star67 instrument0 image2)
   added: (have_image star67 image2)
   goals met: 35 of 37
96. (turn_to satellite0 groundstation41 star67)
   deleted: (pointing satellite0 star67)
   added: (pointing satellite0 groundstation41)
   goals met: 36 of 37
97. (turn_to satellite0 star72 groundstation41)
   deleted: (pointing satellite0 groundstation41)
   added: (pointing satellite0 star72)
   goals met: 35 of 37
98. (take_image satellite0 star72 instrument0 image3)
   added: (have_image star72 image3)
   goals met: 36 of 37
99. (turn_to satellite0 groundstation41 star72)
   deleted: (pointing satellite0 star72)
   added: (pointing satellite0 groundstation41)
   goals met: 37 of 37
